# 1. 기계학습 소개
## 1).  기계학습의 개념
### (1) 전통적인 프로그램과 기계학습

**전통적인 프로그램**
- 정해진 규칙 (프로그래머)
- 새로운 규칙 (프로그램 수정)
- 자료 축적 불필요

**기계학습**
- 스스로 학습
- 프로그램 수정 불필요
- 자료 축적 불필요


### (2) 기계학습의 정의

*"**컴퓨터가 배울 수 있는 능력** "* 즉, 프로그램으로 정의하지 않아도, 컴퓨터가 스스로 학습하여 실행할 수 있는 능력에 대한 연구분야.

- 인공지능(AI)
- 기계학습(ML) : 인공지능의 한 분야이며, 데이터를 이용해서 학습시키는 방법론
- 딥러닝(DL) : ANN 알고리즘을 이용한 기계학습의 한 분야

### (3) 기계학습의 종류

 1. **지도학습** (Supervised Learning)
	 - 분류 (Classification)
	 - 회귀 (Regression)
 2. **비지도학습** (Unsupervised Learning)
 3. **강화학습** (Reinforcement Learning)

> **지도학습** (Supervised Learning)
- 레이블이 있는 학습 자료를 가지고 컴퓨터가 반복적으로 학습하는 과정
- 학습 후 결과를 예측
- 예측한 값과 실제 정답인 레이블을 비교하여 정확히 어떻게 예측했는지 여부를 비드백 받아 학습을 반복할 수 있음.

>**비지도학습** (Unsupervised Learning)
- 컴퓨터가 스스로 자료를 모델링하는 학습 방법
- 레이블이 없음
- 컴퓨터가 다양한 연습을 해가며, 데이터 자체에서 패턴을 찾아내는 학습 방법

>**강화학습**(Reinforcement Learning)
- 어떤 주어진 환경에서, 어떤 행동을 한 것에 대해 보상을 적절히 해줌으로써, 보상을 극대화하는 방법으로 컴퓨터가 학습하는 것.
- 어떤 행위가 최종 결과에 어떤 영향을 주었는지 불명확한 문제에 자주 사용
